logs/async/4/ab_results-async-20.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /async
Document Length:        144 bytes

Concurrency Level:      20
Time taken for tests:   0.470 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      388000 bytes
HTML transferred:       144000 bytes
Requests per second:    2129.34 [#/sec] (mean)
Time per request:       9.393 [ms] (mean)
Time per request:       0.470 [ms] (mean, across all concurrent requests)
Transfer rate:          806.82 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     2    9   4.0      7      22
Waiting:        2    8   3.2      7      21
Total:          3    9   4.0      8      23

Percentage of the requests served within a certain time (ms)
  50%      8
  66%     10
  75%     12
  80%     13
  90%     15
  95%     17
  98%     19
  99%     20
 100%     23 (longest request)